In [1]:
#2차원 array, list
#기본적으로 csv 지원
import numpy as np
import pandas as pd

In [2]:
a = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
a

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [3]:
a.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [4]:
data = {'city':['서울', '부산', '광주', '대구'],
       'year':[2000, 2001, 2002, 2002],
       'pop':[4000, 2000, 1000, 1000]}

pd.DataFrame(data)

  city  year   pop
0   서울  2000  4000
1   부산  2001  2000
2   광주  2002  1000
3   대구  2002  1000

In [5]:
from pandas import DataFrame
DataFrame(data)

  city  year   pop
0   서울  2000  4000
1   부산  2001  2000
2   광주  2002  1000
3   대구  2002  1000

In [6]:
newdata = DataFrame(data)
newdata.dtypes

city    object
year     int64
pop      int64
dtype: object

In [7]:
print(len(newdata))
print(newdata.shape)
print(newdata.shape[0])
print(newdata.shape[1])

4
(4, 3)
4
3

In [8]:
DataFrame(data, columns=['year', 'city', 'pop'])

   year city   pop
0  2000   서울  4000
1  2001   부산  2000
2  2002   광주  1000
3  2002   대구  1000

In [9]:
dicdata = {'Seoul':{2001:20, 2002:30},
           'Busan':{2000:10, 2001:200, 2002:300}}

DataFrame(dicdata)

      Seoul  Busan
2001   20.0    200
2002   30.0    300
2000    NaN     10

In [10]:
np.random.seed(100)
randf = DataFrame(np.random.randn(6, 4))
randf.columns = ['A', 'B', 'C', 'D']
randf.index = pd.date_range('20160701', periods=6)
randf

                   A         B         C         D
2016-07-01 -1.749765  0.342680  1.153036 -0.252436
2016-07-02  0.981321  0.514219  0.221180 -1.070043
2016-07-03 -0.189496  0.255001 -0.458027  0.435163
2016-07-04 -0.583595  0.816847  0.672721 -0.104411
2016-07-05 -0.531280  1.029733 -0.438136 -1.118318
2016-07-06  1.618982  1.541605 -0.251879 -0.842436

In [11]:
DataFrame(data, columns=['year', 'city', 'pop', 'debt'])

   year city   pop debt
0  2000   서울  4000  NaN
1  2001   부산  2000  NaN
2  2002   광주  1000  NaN
3  2002   대구  1000  NaN

In [12]:
DataFrame(data, columns=['year', 'city', 'pop', 'debt'],
         index=['one', 'two', 'three', 'four'])

       year city   pop debt
one    2000   서울  4000  NaN
two    2001   부산  2000  NaN
three  2002   광주  1000  NaN
four   2002   대구  1000  NaN

In [13]:
newdata.loc[newdata.shape[0]] = ['인천', 1000, 2002]
newdata

  city  year   pop
0   서울  2000  4000
1   부산  2001  2000
2   광주  2002  1000
3   대구  2002  1000
4   인천  1000  2002

In [14]:
newdata.loc['five', :] = ['경기', 1000, 2002]
newdata

     city    year     pop
0      서울  2000.0  4000.0
1      부산  2001.0  2000.0
2      광주  2002.0  1000.0
3      대구  2002.0  1000.0
4      인천  1000.0  2002.0
five   경기  1000.0  2002.0

In [15]:
df = DataFrame(data, columns=['year', 'city', 'pop', 'debt'],
              index=['one', 'two', 'three', 'four'])
df

       year city   pop debt
one    2000   서울  4000  NaN
two    2001   부산  2000  NaN
three  2002   광주  1000  NaN
four   2002   대구  1000  NaN

In [16]:
print(df.columns)
print(df.index)

Index(['year', 'city', 'pop', 'debt'], dtype='object')
Index(['one', 'two', 'three', 'four'], dtype='object')

In [17]:
df['city']

one      서울
two      부산
three    광주
four     대구
Name: city, dtype: object

In [18]:
df['year']

one      2000
two      2001
three    2002
four     2002
Name: year, dtype: int64

In [19]:
df.year

one      2000
two      2001
three    2002
four     2002
Name: year, dtype: int64

In [20]:
df[['year', 'pop']]

       year   pop
one    2000  4000
two    2001  2000
three  2002  1000
four   2002  1000

In [21]:
df.loc['three']

year    2002
city      광주
pop     1000
debt     NaN
Name: three, dtype: object

In [22]:
df.loc['three', 'year']

2002

In [24]:
df.loc['three', 'year':'pop']

year    2002
city      광주
pop     1000
Name: three, dtype: object

In [25]:
df.loc[:, 'year':'pop']

       year city   pop
one    2000   서울  4000
two    2001   부산  2000
three  2002   광주  1000
four   2002   대구  1000

In [26]:
df.iloc[1:]

       year city   pop debt
two    2001   부산  2000  NaN
three  2002   광주  1000  NaN
four   2002   대구  1000  NaN

In [27]:
df.iloc[1]

year    2001
city      부산
pop     2000
debt     NaN
Name: two, dtype: object

In [28]:
df.iloc[0:2, 0:2]

     year city
one  2000   서울
two  2001   부산

In [29]:
df.year.iloc[1:]

two      2001
three    2002
four     2002
Name: year, dtype: int64

In [30]:
print(df.year.iloc[1])

2001

In [31]:
print(df.iloc[1, 0])

2001

In [34]:
print(df['year']>2000)
print(df.loc[df['year']>2000, :])
print(df.loc[df['year']<2002, ['city', 'pop']])
print(df.loc[(df['year']<2002) & (df['pop']>1000), :])

one      False
two       True
three     True
four      True
Name: year, dtype: bool
       year city   pop debt
two    2001   부산  2000  NaN
three  2002   광주  1000  NaN
four   2002   대구  1000  NaN
    city   pop
one   서울  4000
two   부산  2000
     year city   pop debt
one  2000   서울  4000  NaN
two  2001   부산  2000  NaN

In [35]:
ddf = df.copy()
ddf.loc[ddf['year']>2001, 'pop'] = 0
ddf

       year city   pop debt
one    2000   서울  4000  NaN
two    2001   부산  2000  NaN
three  2002   광주     0  NaN
four   2002   대구     0  NaN

In [36]:
num = DataFrame(np.arange(9).reshape(3, 3),
               index=['a', 'b', 'd'], columns=['x', 'y', 'z'])
num

   x  y  z
a  0  1  2
b  3  4  5
d  6  7  8

In [37]:
num2 = num.copy()
num2 = num2.reindex(['a', 'b', 'c', 'd'])
num2

     x    y    z
a  0.0  1.0  2.0
b  3.0  4.0  5.0
c  NaN  NaN  NaN
d  6.0  7.0  8.0

In [38]:
num22 = num.copy()
num22.loc[['a', 'b', 'c', 'd'], :]

KeyError: "Passing list-likes to .loc or [] with any missing labels is no longer supported. The following labels were missing: Index(['c'], dtype='object'). See https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike"

In [39]:
num3 = num.copy()
num3 = num3.reindex(columns=['x', 'y', 'w', 'z'])
num3

   x  y   w  z
a  0  1 NaN  2
b  3  4 NaN  5
d  6  7 NaN  8

In [40]:
num32 = num3.copy()
num32.loc[:, ['x', 'y', 'w', 'z']]

   x  y   w  z
a  0  1 NaN  2
b  3  4 NaN  5
d  6  7 NaN  8

In [41]:
df2 = df.copy()
df2.debt = [1000, 2000, 3000, 4000]
print(df2)
print(df)

       year city   pop  debt
one    2000   서울  4000  1000
two    2001   부산  2000  2000
three  2002   광주  1000  3000
four   2002   대구  1000  4000
       year city   pop debt
one    2000   서울  4000  NaN
two    2001   부산  2000  NaN
three  2002   광주  1000  NaN
four   2002   대구  1000  NaN

In [42]:
df3 = df
df3.debt = [1000, 2000, 3000, 4000]
print(df3)
print(df)

       year city   pop  debt
one    2000   서울  4000  1000
two    2001   부산  2000  2000
three  2002   광주  1000  3000
four   2002   대구  1000  4000
       year city   pop  debt
one    2000   서울  4000  1000
two    2001   부산  2000  2000
three  2002   광주  1000  3000
four   2002   대구  1000  4000

In [43]:
df4 = df.copy()
val = pd.Series([5000, 6000, 7000, 8000])
print(val.index)
print(df4.index)

RangeIndex(start=0, stop=4, step=1)
Index(['one', 'two', 'three', 'four'], dtype='object')

In [44]:
df4['debt'] = val
df4

       year city   pop  debt
one    2000   서울  4000   NaN
two    2001   부산  2000   NaN
three  2002   광주  1000   NaN
four   2002   대구  1000   NaN

In [45]:
df5 = df2.copy()
val2 = pd.Series([5000, 6000, 7000, 8000],
                index = df5.index)
df5['debt'] = val2
df5

       year city   pop  debt
one    2000   서울  4000  5000
two    2001   부산  2000  6000
three  2002   광주  1000  7000
four   2002   대구  1000  8000

In [46]:
df6 = df2.copy()
val3 = pd.Series([5000, 7000, 8000],
                index=['one', 'three', 'four'])
df6['debt'] = val3
df6

       year city   pop    debt
one    2000   서울  4000  5000.0
two    2001   부산  2000     NaN
three  2002   광주  1000  7000.0
four   2002   대구  1000  8000.0

In [47]:
df2['aaa'] = df2.city == '서울'
df2

       year city   pop  debt    aaa
one    2000   서울  4000  1000   True
two    2001   부산  2000  2000  False
three  2002   광주  1000  3000  False
four   2002   대구  1000  4000  False

In [48]:
randf['F'] = [1.0, np.nan, 3.5, 6.1, np.nan, 7.0]
randf

                   A         B         C         D    F
2016-07-01 -1.749765  0.342680  1.153036 -0.252436  1.0
2016-07-02  0.981321  0.514219  0.221180 -1.070043  NaN
2016-07-03 -0.189496  0.255001 -0.458027  0.435163  3.5
2016-07-04 -0.583595  0.816847  0.672721 -0.104411  6.1
2016-07-05 -0.531280  1.029733 -0.438136 -1.118318  NaN
2016-07-06  1.618982  1.541605 -0.251879 -0.842436  7.0

In [49]:
randf.dropna(how='any')

                   A         B         C         D    F
2016-07-01 -1.749765  0.342680  1.153036 -0.252436  1.0
2016-07-03 -0.189496  0.255001 -0.458027  0.435163  3.5
2016-07-04 -0.583595  0.816847  0.672721 -0.104411  6.1
2016-07-06  1.618982  1.541605 -0.251879 -0.842436  7.0

In [50]:
randf.dropna(how='all')

                   A         B         C         D    F
2016-07-01 -1.749765  0.342680  1.153036 -0.252436  1.0
2016-07-02  0.981321  0.514219  0.221180 -1.070043  NaN
2016-07-03 -0.189496  0.255001 -0.458027  0.435163  3.5
2016-07-04 -0.583595  0.816847  0.672721 -0.104411  6.1
2016-07-05 -0.531280  1.029733 -0.438136 -1.118318  NaN
2016-07-06  1.618982  1.541605 -0.251879 -0.842436  7.0

In [51]:
randf.fillna(value=0.5)

                   A         B         C         D    F
2016-07-01 -1.749765  0.342680  1.153036 -0.252436  1.0
2016-07-02  0.981321  0.514219  0.221180 -1.070043  0.5
2016-07-03 -0.189496  0.255001 -0.458027  0.435163  3.5
2016-07-04 -0.583595  0.816847  0.672721 -0.104411  6.1
2016-07-05 -0.531280  1.029733 -0.438136 -1.118318  0.5
2016-07-06  1.618982  1.541605 -0.251879 -0.842436  7.0

In [52]:
df3 = df2.copy()
df4 = df2.copy()

df2.columns

Index(['year', 'city', 'pop', 'debt', 'aaa'], dtype='object')

In [54]:
del df2['aaa']
df2.columns

Index(['year', 'city', 'pop', 'debt'], dtype='object')

In [55]:
df3.drop('aaa', axis=1)

       year city   pop  debt
one    2000   서울  4000  1000
two    2001   부산  2000  2000
three  2002   광주  1000  3000
four   2002   대구  1000  4000

In [56]:
df4.drop(['aaa', 'year'], axis=1)

      city   pop  debt
one     서울  4000  1000
two     부산  2000  2000
three   광주  1000  3000
four    대구  1000  4000

In [57]:
newdata2 = newdata.copy()
newdata.index

Index([0, 1, 2, 3, 4, 'five'], dtype='object')

In [58]:
newdata.drop(4)

     city    year     pop
0      서울  2000.0  4000.0
1      부산  2001.0  2000.0
2      광주  2002.0  1000.0
3      대구  2002.0  1000.0
five   경기  1000.0  2002.0

In [59]:
newdata2.drop([3, 4])

     city    year     pop
0      서울  2000.0  4000.0
1      부산  2001.0  2000.0
2      광주  2002.0  1000.0
five   경기  1000.0  2002.0

In [60]:
num4 = num.copy()
num4 = num4.reindex(index=num2.index, columns=num3.columns)
num4

     x    y   w    z
a  0.0  1.0 NaN  2.0
b  3.0  4.0 NaN  5.0
c  NaN  NaN NaN  NaN
d  6.0  7.0 NaN  8.0

In [61]:
num5 = num.copy()
num5 = num5.reindex(index=num2.index, columns=num3.columns, method='ffill')
num5

   x  y   w  z
a  0  1 NaN  2
b  3  4 NaN  5
c  3  4 NaN  5
d  6  7 NaN  8

In [64]:
num6 = num.copy()
num6 = num6.loc[['a', 'b', 'c', 'd'], num3.columns]
num6

KeyError: "Passing list-likes to .loc or [] with any missing labels is no longer supported. The following labels were missing: Index(['c'], dtype='object'). See https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike"